"SPC Password" = "SPC-jelszó";
"Authentication Key" = "Hitelesítési kulcs";
"Incorrect key" = "Helytelen kulcs";
"Incorrect SPC Password" = "Helytelen SPC-jelszó";
"Enter 26 digit key" = "Adja meg a 26 hegyű hitelesítési kulcsot.";
"Security" = "Biztonság";
"Too many retries of SPC." = "SPC túl sokszor történő próbálkozása.";
"AKEY set successfully." = "AKEY sikeresen beállítva.";
"Failed to set AKEY." = "Az AKEY beállítása sikertelen volt.";
"Too many retries of AKEY." = "AKEY túl sokszor történő próbálkozása.";
"Password" = "Jelszó";
"Key" = "Kulcs";
"OK" = "OK";
"Cancel" = "Mégsem";